//Дефинирайте променливи със стойност
//4.9876543, 7.123456789012345678890, 18 398 458 438 583 853.28, 18 398 458 438 583 853.39875937284928422.
//Изведете всяка променлива на екрана с printf()

#include<stdio.h>


int main()
{

	float var1 = 4.9876543;
	long double var2 = 7.123456789012345678890L;
	long double var3 = 18398458438583853.28L;
	long double var4 = 18398458438583853.39875937284928422L;

	printf("%f\n", var1);
	printf("%e\n", var2);
	printf("%e\n", var3);
	printf("%e\n", var4);


	return 0;
}
